[{"type":"Ball Junk Podcast","title":"Episode 48: NFL Season Preview 2021","slug":"episode-48-nfl-season-preview-2021","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk47.mp3","description":"Episode 48 of the Ball Junk Podcast is here and it's our annual NFL Preview.   Regular season rankings and playoff predictions.  Did we once again predict the same Super Bowl match-up?  Listen to find out.  Plus, we get some Ultra Bold Predictions from Frankie, play a game of Likely or Unlikely, answer your questions in Sack Time and poor ol' Frankie gets the Gas Pedal.  Subscribe and download on all your favourite podcast providers.  Balls! \r\n","date":"2021-09-13T04:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 47: Space Jam Reviews","slug":"episode-47-space-jam-reviews","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk47.mp3","description":"Jordan vs. LeBron.  A debate with no end in sight for most.  Finally, two heroes enter the stage to decide once and for all who is better and they do it by watching and reviewing SPACE JAM and SPACE JAM: A NEW LEGACY.  How else could this be settled?  It's Episode 47 of the Ball Junk Podcast!   This time, The Gasman and Frankie Knuckles talk about the sweet merger between the NBA and the Looney Tunes, discuss the 2021 NBA Champions and what to expect in the off season!  We also answer all of your Olympics questions in Sack Time and poor Frankie once again gets the Ole' Gas Pedal.   What kind of pasta goes well with the Italian Euro 2021 Championship win?  Find out when you download and subscribe on Spotify, Apple Pods, Stitcher and Google Pods.  \r\n","date":"2021-07-27T14:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 46: NBA Playoffs 2021","slug":"episode-46-nba-playoffs-2021","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk46.mp3","description":"The NBA Playoffs are here and we're so pumped we did the show twice!  We break down the playoff matches and make our predictions for 2021 NBA Champions.  We also talk Kwame Brown's internet presence and discuss the incredible marriage between the NBA and the MCU!  Clearly, only Dr. Strange knows what can happen.  We answer your questions in Sack Time and Frankie gets the Gas Pedal.   Check out episode 46 of the Ball Junk Podcast.  It's Craig Ferguson approved!\r\n","date":"2021-05-24T14:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 45: The Mighty Ducks","slug":"episode-45-the-mighty-ducks","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk45.mp3","description":"What's up, Cake Eaters?  A brand new episode of the Ball Junk Podcast is here for you.  On the show we look back at the Super Bowl and go over Frankie's \"Likely or Unlikely\" results from before the season.  We chat some NBA and welcome Sean from Film Junk onto the pod to take a look back and review \"The Mighty Ducks\" as well as the first two episodes of \"Young Rock\".  They both play a game of \"Real or Fake\", answer your Sack Time questions and as always Frankie gets the ol' Gas Pedal.  It's Episode 45 of the Ball Junk Podcast!  Balls!\r\n","date":"2021-03-02T14:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 44: 6th Annual New Year's Ball Junk Drop","slug":"episode-44-6th-annual-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk44.mp3","description":"Let the countdown begin!  It's the annual Ball Junk New Year's Eve Ball Drop episode of the Ball Junk Podcast.  We discuss the NFL playoff picture and gush over Week 17's match-ups with a focus on Bills vs. Dolphins.  We also preview the upcoming NBA season and make our playoff predictions.  Plus, we answer your Sack Time questions and Frankie gets the Gas Pedal.  Have a safe and happy New Year from the crew of the Ball Junk Podcast! Balls!\r\n","date":"2020-12-31T14:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 43: NFL Season Update 2020","slug":"episode-43-nfl-season-update-2020","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk43.mp3","description":"TORNADO WARNING IN EFFECT!  On this episode of the Ball Junk Podcast, we brave strong winds and torrential rains to get this podcast to you.  It's the mid point of the NFL season and we recap what's been going on.  We talk Bills and Dolphins, young quarterbacks, our pre season picks and Frankie accuses me of being a Pats fan.   We also recap the NBA playoffs and celebrate the Lakers historic win.  There is the debut of a brand new game for Frankie called Before and After and his lack of non North American sports shines through.  You get all of that and a little more on Episode 43 of the Ball Junk Podcast.  Balls!\r\n","date":"2020-11-17T14:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 42: NFL Season Preview 2020","slug":"episode-42-nfl-season-preview-2020","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk42.mp3","description":"'OMAHA! OMAHA!'  The NFL is back and so is our Annual NFL Pigskin Preview!  We make our (ULTRA BOLD) predictions on division winners and losers, who wins the wild card games and who will be Super Bowl Champions.  We discuss what's happening in the NBA, the NHL and in MLB.  Frankie plays a 2020 NFL Season game of 'Likely or Unlikely'.  We answer your questions in 'Sack Time' and Frankie gets the 'Gas Pedal.   It's Episode 42 of the Ball Junk Podcast.  Download and subscribe on all of your favourite podcast apps.  Apple, Google, Stitcher and Spotify!  \r\n","date":"2020-09-10T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 41: Sports Impending Return","slug":"episode-41-sports-impending-return","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk41.mp3","description":"We're back!  After a long layoff we're happy to bring you a socially distanced episode of the Ball Junk Podcast.  We're recording at a safe 32 kilometres apart and we have a packed show.  It's the return of Sports!  We discuss plans for the NBA, MLS, NHL, NFL and MLB.  We review Ben Affleck's starring role as an alcoholic, reluctant youth basketball coach in The Way Back, Real or Fake: Magic Johnson Tweets returns and of course we answer your questions in Sack Time.  Download and subscribe to the show on Apple Podcasts, Stitcher, Spotify and Google Pods.  Balls!\r\n","date":"2020-06-12T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 40: 5th Annual New Year’s Ball Junk Drop","slug":"episode-40-5th-annual-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk40.mp3","description":"As 2019 comes to a close what better way to welcome a new decade in than with the Annual New Year's Eve Ball Drop Ball Junk Podcast! We discuss how Frankie is once again out on the NBA, make our NFL Playoff picks, play a new game of Real or Fake and discuss all of the non stories of 2019.  It's time to drop that Ball and celebrate a New Year with the Ball Junk Podcast!\r\n","date":"2019-12-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 39: NBA Season Preview 2019","slug":"episode-39-nba-season-preview-2019","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk39.mp3","description":"Dust off your CD copy of John Tesh's 'Roundball Magic' and crank it up! The NBA is back and so is the Annual Ball Junk NBA Preview!  Frankie Knuckles is sort of 'back in' and we get some ULTRA BOLD PREDICTIONS during our rundown.  We bring back on old favourite in 'Real or Fake', learn about lucky toilets and answer a huge bag of Sack Time!  So get ready for the Gas Pedal, make a toast to Brian Skrudland and bask in the glory of the Los Angeles Lakers! It's the Ball Junk Podcast NBA Preview! Balls!\r\n","date":"2019-11-04T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 38: NFL Season Preview 2019","slug":"episode-38-nfl-season-preview-2019","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk38.mp3","description":"The NFL is back! It's time for the annual Ball Junk Podcast NFL Preview and Prediction Show!  We break down each division and pick our winners and wild cards.  Frankie throws in some ultra bold predictions and we make our Super Bowl predictions. We also discuss News and Notes and do our fan favourite regular features! It's all here in Episode 38!  BALLS!\r\n","date":"2019-09-09T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 37: NBA Free Agent Frenzy","slug":"episode-37-nba-free-agent-frenzy","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk37.mp3","description":"It's the podcast you've been waiting for.  Ball Junk Episode 37: NBA Free Agent Frenzy!  What a wild week it was and we recap it all including our predictions for the NBA line up for Christmas Day 2019.  Frankie Knuckles also reveals whether he is back in on the NBA.  We play a game of Real or Fake, discuss Balls Around the World, answer your questions in Sack Time and Frankie gets the Gas Pedal.  If you ever wanted a podcast that discusses Sandy Beveridge, Pete LaCock, Ferret Legging, Knitting, Metal and Dash Wilder's sweet, sweet sucker punch then Ball Junk is for you.  Download and subscribe on Apple Podcasts, Stitcher, Google Play and possibly Spotify.  Balls!","date":"2019-07-19T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 36: NBA Draft Lottery","slug":"episode-36-nba-draft-lottery","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk36.mp3","description":"The most anticipated episode of the Ball Junk Podcast is here! The mystic powers of the NBA have given Frankie a way back in. We talk the NBA Draft Lottery, the Pelicans, AD, the Lakers, Magic and uncredited bit borrowing. We dig a little into the NFL Draft, bring back OUR game of Real or Fake and all of your favourite segments. Check it out here or subscribe and download on iTunes!  BALLS!  ","date":"2019-05-20T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 35: Fighting with My Family","slug":"episode-35-fighting-with-my-family","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk35.mp3","description":"BALL BREAKING NEWS: The Ball Junk Podcast has a special guest for the very first time! It's Dax Gordine and he jumps on the show to talk about WWE Films' latest venture, Fighting With My Family.  We also talk about the longest and most violent game of soccer ever! Plus, NFL news, Frankie hates the NBA, an incredible edition of Sack Time and of course, Knuckles gets the Gas Pedal. Download, subscribe and listen on iTunes or check us out right here!  It's Episode 35 of the Ball Junk Podcast! Balls!","date":"2019-03-17T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 34: 4th Annual New Year's Ball Junk Drop","slug":"episode-34-4th-annual-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk34.mp3","description":"It's the 4th Annual New Year's Ball Junk Drop! We catch up with the NFL and NBA plus we also talk Balls Around the World and take time for the final 2018 game of Real or Fake. Balls! ","date":"2018-12-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 33: NBA Season Preview 2018","slug":"episode-33-nba-season-preview-2018","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk33.mp3","description":"The Annual Ball Junk NBA Preview is here and it's the show you've been waiting for.  We make our predictions on which teams will make the playoffs, who will be the 2019 NBA Champions and reveal the results of the NBA Off Season Game of Likely or Unlikely.  You can also listen as Frankie Knuckles goes off on media pushed MVP's, horrible officiating and pretty much everything else.  We take your feedback and questions in Sack Time and Frankie, once again, gets the Gas Pedal.  Download and subscribe on iTunes or listen right here.  It's Episode 33 of the Ball Junk Podcast!  Balls! ","date":"2018-10-26T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 32: NFL Season Preview 2018","slug":"episode-32-nfl-season-preview-2018","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk32.mp3","description":"OMAHA!  The NFL is back and so is the Ball Junk Podcast!  It's our annual NFL preview where we talk winners and losers and make our predictions of who is going to the playoffs.  It's our most shocking result ever!  We also review Helen Hunt's volleyball movie, The Miracle Season and of course Sack Time, a game of Real of Fake and the Gas pedal.  Subscribe and download on iTunes or listen right here!  It's Episode 32 of the Ball Junk Podcast!  Balls! ","date":"2018-08-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 31: World Cup 2018","slug":"episode-31-world-cup-2018","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk31.mp3","description":"GOOOOOOOAAAAALLLLLLLLLLL!!!!!!  Episode 31 of the Ball Junk Podcast is upon you, so sit back and listen to two dudes who know nothing about footy break down the game's biggest event.  We make our terrible and somewhat Ultra Bold predictions on the tournament and discuss the recent NBA and NHL playoffs.  Frankie also plays a new game around NBA Free Agency and takes the Gas Pedal.  Subscribe, download and listen on iTunes or right here!  BizNasty for the HOF!  Balls! ","date":"2018-06-16T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 30: Andre the Giant Documentary and 2018 NBA Playoffs","slug":"episode-30-andre-the-giant-documentary-and-2018-nba-playoffs","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk30.mp3","description":"As 'Captain' Lou Albano once said: \"He's the 8th, 9th, 10th and 11th Wonder of the World!\" It's Andre the Giant and he's the subject of a new HBO documentary.  On Episode 30 of the Ball Junk Podcast, the Gasman and Frankie Knuckles sit down and give our review.  What's good?  What's bad? Who's the real star, brother?  We also dive deep into the NBA Playoffs and give our predictions on Round 1 and beyond.  We briefly chat the NHL Playoffs, WrestleMania, answer your Sack Time questions and good ol' Frankie gets the Gas Pedal.  Download and subscribe to the Ball Junk Podcast on iTunes or listen right here!  'Heeey Bossss!'.  Balls!","date":"2018-04-15T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 29: 3rd Annual New Year's Ball Junk Drop","slug":"episode-29-3rd-annual-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk29.mp3","description":"Happy New Year!  Forget Times Square.  Forget Zombie Dick Clark.  Spend your last moments of 2017 with Episode 29 of the Ball Junk Podcast as we present our annual New Years Eve Ball Drop!  Listen in as we talk the NFL Playoff Picture, the near midway point of the NBA season and a double dose of reviews!  We discuss ESPN's 30 For 30 documentary 'Nature Boy' and 'Battle of the Sexes'.  Don't worry, Knucks still gets the Holiday Gas Pedal.  Subscribe and download on iTunes or check us out right here.  Here's to more balls in 2018!","date":"2017-12-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 28: NBA Season Preview 2017","slug":"episode-28-nba-season-preview-2017","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk28.mp3","description":"Our crossover breaks ankles like Gordon Hayward...breaks ankles.  Get real!  It's Episode 28 of the Ball Junk Podcast and we're back with our 2018 NBA Preview!  Best and worst in the East and West, who's making the playoffs and who's in tank mode, plus our predictions on the Conference and NBA Finals!  We take a look at the craziness of the current NFL season so far and how it makes 'Knucks juices flow.  Frankie plays Before and After, we talk competitive tag and the RedTubers of Washington Square.  All that, plus Sack Time and the Gas Pedal.  Put on your Fifty Mission Cap and give this pod a listen.  Download, subscribe and rate us (5 stars, naturally) on iTunes!  Balls!","date":"2017-10-19T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 27: NFL Season Preview 2017","slug":"episode-27-nfl-season-preview-2017","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk27.mp3","description":"Grip your pigskin and settle down for our NFL Preview!   The Gasman and Frankie Knuckles break down each division and conference and make out playoff predictions.  Knucks, as always, offers up some Ultra Bold Predictions and Steaming Hot Takes!  We also dive deep in some of the biggest sports stories of the summer including the IT/Kyrie trade, Ice Cube's Big 3, Ric Flair, Jon Jones and Frankie picks the Prop Bets for Mayweather/McGregor.  All that, plus Sack Time and the Gas Pedal.  It's Episode 27 of the Ball Junk Podcast!  Happy Birthday Mamba!","date":"2017-08-25T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 26: NBA and NHL Playoffs 2017","slug":"episode-26-nba-and-nhl-playoffs-2017","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk26.mp3","description":"Finally, Ball Junk has come back...to your ear holes!  After a long break for New Year's Eve, Valentine's Day, Good Friday, Adequate Saturday and Easter Sunday recovery, we're back to talking about our limited knowledge of sports!  On this show we break down the NBA and NHL playoffs and we discuss the AL East, the Vegas Golden Knights, the Las Vegas Raiders, snow running, car curling, giant sized gambling and a whole mess load of Sack Time questions in the mailbag.  All of this for your listening pleasure and it's free! Ball Junk Podcast Episode 26 is here.  Subscribe, download and rate us (5 stars) on iTunes!  Balls!","date":"2017-04-29T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 25: 2nd Annual New Year's Ball Junk Drop","slug":"episode-25-2nd-annual-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk25.mp3","description":"Get outta here, 2016!  It was an unbelievable year in sports and Episode 25 of the Ball Junk Podcast is our New Years Eve Ball Drop Spectacular. We're talking the biggest sports stories of 2016!  Knucks lays down his Ultra Bold Sports predictions of 2017 and we reveal why the 1900 Paris Olympics was the greatest Olympics ever.  We pay homage to the sports heroes we lost this year as well as answer your Sack Time questions, plus Frankie takes the Gas pedal.  It's all here in this two hour end of year extravaganza!  Subscribe, download and rate us on iTunes and have a safe and Ballsy New Year!","date":"2016-12-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 24: NBA Season Preview 2016-2017","slug":"episode-24-nba-season-preview-2016-2017","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk24.mp3","description":"Finally!  Episode 24 of the Ball Junk Podcast is here and no house fire is going to stop us this time.  It's our annual NBA preview where we make our predictions on who wins the divisions, who wins the Finals, who is Rookie of the Year and who is MVP.  Plus, we discuss the NFL Season so far and see where our early predictions stand mid-season.  We bring back a Ball Junk favourite too, it's Real or Fake: Magic Johnson Tweets Part 2.  We look at Balls Around the World, answer your Sack Time questions, Knucks gets the Gas Pedal and did Frankie really throw a dildo on the field?  Download, subscribe and hit us with a 5 Star rating on iTunes so you can add value to your existence!  Balls!","date":"2016-11-03T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 23: NFL Season Preview 2016","slug":"episode-23-nfl-season-preview-2016","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk23.mp3","description":"The NFL is back and so is the Ball Junk Podcast.  It's our annual NFL Preview show and episode 23 kicks off with a bang!   We recap the summer in sports, talk a little Bachelor in Paradise and then bring you our NFL Ultra Bold Predictions.  Who do we think make the playoffs and who wins the Super Bowl? We talk Harambe, we talk gravedigging, we talk Olympic Handball!  Knucks plays a new game of Real or Fake plus all of our regular features.  Celebrate the NFL and Bob Gainey with Episode 23 of the Ball Junk Podcast. Download, subscribe and rate us on iTunes now!  Balls!","date":"2016-09-11T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 22: NBA Finals 2016","slug":"episode-22-nba-finals-2016","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk22.mp3","description":"We've got Hot Takes for Episode 22 of the Ball Junk Podcast! As we get ready for the NBA Finals, we talk the playoffs so far, the NBA Draft and Free Agency, make our picks for Euro 2016, the NHL Playoffs and the Jays/Rangers brawl. Frankie plays a game of Real or Fake, Dick Enberg loves fat cats and we answer all of your questions in Sack Time! Subscribe and download on iTunes and don't forget about that 5 Star Rating. Balls!","date":"2016-06-03T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 21: NBA Playoffs 2016","slug":"episode-21-nba-playoffs-2016","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk21.mp3","description":"It's Mamba Time for the Ball Junk Podcast!  Episode 22 is here and we're talkin' Kobe Bryant's final game, the Golden State Warriors 73 win season, the NBA Playoffs and the NHL Playoffs!  We pick our round by round winners and make Ultra Bold Predictions on who's walking away with the Championships.  We talk chaps and vomit in Balls Around the World, answer your questions in Sack Time and Frankie takes the Gas Pedal like a champ!  Download, subscribe and give us a 5 star rating on iTunes!  Mamba Out!","date":"2016-04-17T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 20: The Resurrection of Jake the Snake","slug":"episode-20-the-resurrection-of-jake-the-snake","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk20.mp3","description":"Well, slap my Momma and call me 20!  It's a brand new Episode of the Ball Junk Podcast!  The Gasman and Frankie Knuckles are back for the twentieth episode of this award-winning podcast!  We talk about Jamaica, the Super Bowl, NBA All Star Weekend, Steph Curry, the World Cup of Hockey and review the new documentary The Resurrection of Jake the Snake.  Plus, Balls Around the World, your Sack Time Questions and Frankie gets a mean Gas Pedal!  So, lace your boots, download, subscribe and rate us on iTunes!  Balls!","date":"2016-03-05T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 19: New Year's Ball Junk Drop","slug":"episode-19-new-years-ball-junk-drop","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk19.mp3","description":"Let the countdown begin! It's the New Year's Ball Junk Drop Podcast! We're dropping our balls to end 2015 with a packed show. The Gasman and Frankie Knuckles review the new Will Smith film Concussion as well as the latest ESPN 30 for 30 film, Four Falls of Buffalo. We discuss the NFL Playoff Picture, the current NBA Season, Kobe Bryant's retirement and we present the inaugural Ballsy Awards!  Plus, we take our Balls Around the World, answer your questions in Sack Time and Knucks gets the Gas Pedal.  Download, subscribe and rate us on iTunes and end 2015 the right way with Episode 19 of the Ball Junk Podcast.  Happy New Year!  Balls!","date":"2015-12-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 18: NBA Season Preview 2015-2016","slug":"episode-18-nba-season-preview-2015-2016","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk18.mp3","description":"The latest Ball Junk Podcast is here! It's Episode 18 and life you got it, 18 and life you know, your crime is time and it's 18 and life to go! It's our Annual NBA Preview and we make our predictions on who won't make the playoffs and rank our top 8 teams. Do we agree on the Pelicans? Maybe. Do we agree on the Lakers? Maybe not. Subscribe, download and rate the show on iTunes now to find out. We also talk MLB Playoffs, the Jays, the conspiracy, the NHL, the Habs, the NFL, and Knucks admits I was right all along about Tom Brady. There's Balls Around the World, Sack Time and Frankie gets the Gas Pedal. Check it out! Episode 18 of the Ball Junk Podcast. Balls!","date":"2015-10-26T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 17: Major League Special","slug":"episode-17-major-league-special","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk17.mp3","description":"\"Juuuuuuuuuust a bit outside.\" It's the Ball Junk Podcast Major League Freemium!  The Gasman and Frankie Knuckles sit down and discuss Major League 1, 2 and 3!  We discuss the cast, the characters, the logic and the influence of it all!  Did Wesley Snipes get a big ego? Is Taka Tanaka one of the worst ethnic stereotypes ever? Would any of these misfits even come close to sniffing the minor leagues? We cover it all and give our Top 5 and Bottom 5 moments!  Plus, Balls Around the World, Sack Time and the Gas Pedal.  Download and subscribe on iTunes.  We ask Jobu to come, take fear from bats! Balls!","date":"2015-08-20T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 16: 2015 NBA and NHL Finals","slug":"episode-16-2015-nba-and-nhl-finals","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk16.mp3","description":"How sweet to be sixteen again! It's Episode 16 of the Ball Junk Podcast and the Gasman and Frankie Knuckles are back digging deep into the NHL and NBA Playoffs.  We also talk about Showtime's new Allen Iverson documentary, plus, discussions on drafting an NBA starting line-up for $15, what's considered drunk driving, running a marathon dressed as testicles, college recruitment through burritos and how good would a Porkfait be?  All of that and we answer your Sack Time Questions plus Frankie takes the Gas Pedal.  Give it a listen, subscribe and download on iTunes and we promise Frankenslices for everyone! Balls!","date":"2015-06-06T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 15: NBA Playoffs 2015","slug":"episode-15-nba-playoffs-2015","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk15.mp3","description":"BREAKING NEWS: It's Episode 15 of the Ball Junk Podcast and it's the playoffs!  The Gasman and Frankie Knuckles break down the NHL and NBA playoff situation and Frankie gets mad at the Golden State Warriors. We talk fishing for women's underwear, soccer porno, Vince Neil's national anthem and which team mascots we'd MFK.  Frankie gets the Gas Pedal and the Gasman horribly insults the fine folks at Ole Miss!  Find out who was called a whore at the last Hamilton Bulldogs game and why Marshall Henderson is a great human being.  It's all packed into one awesome show.  Ballin'!","date":"2015-04-22T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 14: Kobe Bryant's Muse","slug":"episode-14-kobe-bryants-muse","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk14.mp3","description":"What do you get when you take a huge Kobe Bryant fan and a huge Kobe Bryant hater and have them both watch a self-indulgent documentary about Kobe, produced by Kobe and starring only Kobe?  Well, you get Episode 14 of the Ball Junk Podcast!  Things really get heated between The Gasman and Baby Blu Knucks! We also tackle NFL free agency, the NBA playoff picture, Wrestlemania weekend, ball park foods, Gronking, Sack Time and Frankie takes the Gas Pedal. Subscribe! Download! Balls!","date":"2015-03-22T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode XIII: Super Bowl Spectacular II","slug":"episode-xiii-super-bowl-spectacular-ii","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk13.mp3","description":"Oh, you didn't know? It's Episode 13 of the Ball Junk Podcast!  The Super Bowl Preview show you've all been waiting for.  The Gasman and Frankie Knuckles discuss DeflateGate and all the stories surrounding the Patriots clash with the Seahawks.  We also review Bennet Miller's new film Foxcatcher, talk footy fans in Balls Around the World, answer your questions in Sack Time and Frank once again gets the ol' Gas Pedal.  Download and listen now before the game on Sunday.  Ballin'!\r\n","date":"2015-01-30T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 12: Christmas 2014","slug":"episode-12-christmas-2014","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk12.mp3","description":"'Tis the season to be Bally!  Episode 12 of the Ball Junk Podcast is here and what a festive one it is.  Frankie Knuckles and the Gasman discuss the current state of the NBA and NFL Seasons, review a holiday film classic in Santa With Muscles starring Hulk Hogan, play a game of Who's Got the Mumps and of course take a trip with Balls Around the World (Dildos! Pitchforks!), answer your questions in Sack Time, Frankie gets the Gas Pedal and the Gasman makes his case to have Saku Koivu's number 11 retired by les Bleu, Blanc et Rouge.  What better way to celebrate the holiday season than with a new Ball Junk! Ballin!","date":"2014-12-20T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 11: NBA Season Preview 2014-2015","slug":"episode-11-nba-season-preview-2014-2015","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk11.mp3","description":"Grab your Spaldings and get ready for Episode 11 of the Ball Junk Podcast! The Gasman and Frankie Knuckles bring you the 2014-2015 NBA Preview!  We go team by team, give our analysis on each division and make our predictions on who will win the conferences and the NBA Championship.  We also wrap up the World Series, see where we stand halfway through the NFL season and Frank goes nuts over the Harvey Street Herons. Hit the Gas Pedal and download it now! Ballin'!\r\n","date":"2014-11-01T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 10: NFL Season Preview 2014","slug":"episode-10-nfl-season-preview-2014","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk10.mp3","description":"We're back, Ballhandlers.  Episode 10 of the Ball Junk Podcast and it's a real beauty.  NFL preview time!  We pick division winners, AFC and NFC champions, plus our Super Bowl match-up (we'll be wrong!).  We also talk LeBron, Cleveland, new cars, dog surfing, camel wrestling, 5K fun runs, Vince McMahon, Puke, Bill Belichick's dirty hoodie, bounce some Balls Around the World, answer your questions in Sack Time and Knucks, once again, takes the Gas Pedal. It's two hours of Balls!","date":"2014-09-05T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 9: World Cup 2014","slug":"episode-9-world-cup-2014","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk9.mp3","description":"OLEEEEE! OLE! OLE! OLE! OLEEEEE! OLEEEEE! The Ball Boys are back for Episode 9 of the Ball Junk Podcast and this time we break down World Cup 2014!  We make our picks and agree that the jerseys are just as important as the games.  We throw down over the NBA and NHL Finals and talk about the new film Million Dollar Arm.  Plus, we visit Balls Around the World, answer your questions in Sack Time and Frankie takes the Gas Pedal. Don't be a stickler, download this now. Balls!\r\n","date":"2014-06-05T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 8: NBA and NHL Playoffs 2014","slug":"episode-8-nba-and-nhl-playoffs-2014","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk8.mp3","description":"It's TIME for Episode 8 of the Ball Junk Podcast! The Fabulous Ones return to discuss the NBA and NHL Playoffs, we sit down to review the new film Draft Day and the Gasman convinces Frankie Knuckles to watch Scooby-Doo and the Wrestlemania Mystery! Balls Around the World, Sack Time, the Gas Pedal and much, much more! Download it, listen and love our Balls.","date":"2014-04-26T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 7: March Madness 2014","slug":"episode-7-march-madness-2014","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk7.mp3","description":"Dust off your balls! It's time for Episode 7 of the Ball Junk Podcast!  The Gasman and Frankie Knuckles make their Final Four picks and talk a little March Madness, discuss the latest news in the NBA, hype up some sports docs announced for Hot Docs and reveal the secret connection between Colts QB Andrew Luck and one of our hosts.  All that, plus Balls Around the World, Sack Time and our new feature the Gas Pedal.  Check it out! Ballin!","date":"2014-03-20T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 6: Super Bowl Spectacular","slug":"episode-6-super-bowl-spectacular","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk6.mp3","description":"Are you ready? Are your balls bouncing? The Gasman and Frankie Knuckles are back with Episode 6 of the Ball Junk Podcast (really) and we do the Super Bowl Shuffle (not really).  We talk all things Super Bowl, a little Royal Rumble, a little WWE Network and a little King Cake Baby! Plus, we bounce Balls Around the World and fire off your questions in Sack Time.  Get your sports fix now.  Ballin!","date":"2014-01-31T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 5: Christmas 2013","slug":"episode-5-christmas-2013","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk5.mp3","description":"It's TIME! Ball Junk Episode V - A Good Day To Ball Hard. Get your sports fix as the Gasman and the 'Nature Boy' Frankie Knuckles sit down and chat the latest on the NFL and NBA seasons.  We discuss our best and worst sports related Christmas gifts and do our very first Ball Junk film review! (Hint! It's the greatest story ever told.) Once again, we look at Balls Around the World, answer your questions in Sack Time and figure out whether a 38 year old man watching college girls play volleyball is creepy or not. (Hint! It's not.) Download it now and experience an audio orgasm! Ballin!!","date":"2013-12-19T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 4: 2013-2014 NBA Season Preview","slug":"episode-4-2013-2014-nba-season-preview","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk4.mp3","description":"The Gasman and Frankie Knuckles are back to drop another set of balls on our faithful listeners.  The NBA Season is upon us which calls for a season preview along with some predictions.  We talk some NFL and we take a look at the other side of the coin for our Bottom 5 Franchises in all of sports. As always we visit Balls Around the World and answer your mail questions in Sack Time.  BALLLLLLLLIN!","date":"2013-11-10T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 3: 2013 NFL Season Preview","slug":"episode-3-2013-nfl-season-preview","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk3.mp3","description":"Get your balls bouncing again as the Gasman and Frankie Knuckles violate your ears with Episode 3 of the Ball Junk Podcast.  We break down the upcoming NFL season and make our Super Bowl picks.  We also discuss the best franchises in our Top 5, travel the globe in Balls Around the World and read your mail in Sack Time.  It's more balls than you can handle. Download it now!  BALLLLLLLLIN!","date":"2013-09-09T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 2: Ball Harder","slug":"episode-2-ball-harder","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk2.mp3","description":"After a three month hiatus for a sex change, oil change and diaper change (not necessarily in that order) Ball Junk is back! Frank S. Preston Esq and Greg Theodore Logan sit down to chat sports.  We talk about the Home Run Derby, a good ol' fashioned murder, the NHL and NBA playoffs and how our teams performed.  We bring back Balls Around the World and discuss which sport frowns upon invading rectums. We answer your questions in Sack Time and we even touch on Niagara Roller Derby and the performance of Lovely Cheetah. Sit back, relax and count how many times we go off topic.  It's Ball Junk Episode 2!","date":"2013-07-26T15:00:00.000Z"},{"type":"Ball Junk Podcast","title":"Episode 1: 2013 NBA Playoff Preview","slug":"episode-1-2013-nba-playoff-preview","mp3_link":"http://www.podtrac.com/pts/redirect.mp3/traffic.libsyn.com/filmjunk/balljunk1.mp3","description":"In the premiere episode, Greg and Frank break down the NBA playoffs, discuss their favourite teams and sports, dig into some hilarity around the world, and reach into the mail sack for Bag Time!","date":"2013-04-22T15:00:00.000Z"}]